{
    "metadata":{
       "total_results":null,
       "truncated_results":0,
       "truncated_companies":0,
       "total_companies":null
    },
    "data":[
       {
          "id":232048048,
          "job_title":"Account Executive",
          "url":"https://www.click2apply.net/66ffdcb8d7cc482fcd54d13e",
          "date_posted":"2024-10-04",
          "has_blurred_data":false,
          "company":"A Hiring Company",
          "final_url":"https://www.click2apply.net/66ffdcb8d7cc482fcd54d13e",
          "source_url":"https://www.linkedin.com/jobs/view/4042876652/",
          "location":"Kenosha",
          "short_location":"Kenosha, WI",
          "long_location":"Kenosha, WI",
          "state_code":"Kenosha, WI",
          "latitude":null,
          "longitude":null,
          "postal_code":null,
          "remote":false,
          "hybrid":false,
          "salary_string":"",
          "min_annual_salary":null,
          "min_annual_salary_usd":null,
          "max_annual_salary":null,
          "max_annual_salary_usd":null,
          "avg_annual_salary_usd":null,
          "salary_currency":null,
          "countries":[
             
          ],
          "country":null,
          "cities":[
             
          ],
          "continents":[
             
          ],
          "seniority":"Mid-Level",
          "country_codes":[
             "Array"
          ],
          "country_code":"US",
          "discovered_at":"2024-10-04T12:25:44.264157+00:00",
          "hiring_team":[
             
          ],
          "company_domain":null,
          "reposted":false,
          "date_reposted":null,
          "description":"JOB SUMMARY: \n\nAdams Outdoor Advertising (AOA), the leading advertising platform in Kenosha and the 4th largest Outdoor Advertising firm in the U.S., is seeking Account Executives to support its sales team. Successful candidates will be driven, self-motivated individuals that can collaborate with colleagues and a wide range of prospective clients within a fast-paced environment. \n\nAccount Executives (AEs) will be responsible for taking advantage of AOA’s leading Out-of-Home market share in the greater Kenosha area to sell dynamic outdoor advertising campaigns to current and prospective clients. \n\nAEs will participate in the Adams Onboarding Program, designed to understand Out-of-Home Advertising and its power to drive the most effective return on investment for our clients. The program also seeks to empower new AEs to ensure the requisite skillset is in place in advance of approaching advertisers / potential clients. Program highlights include: \n\n* Introduction to AOA’s Best Practices \n* Participation in AOA’s firmwide \"Lunch and Learn\" program, which highlights innovative sales techniques and helps to drive talent development\n* Assignment of a senior Mentor to help guide initial experience and guide to long-term success\n* Significant exposure to the leadership in the Kenosha market, including the General Manager\nInitial compensation structure consists of a fixed salary. Over time, compensation structure transitions to salary plus commissions. With demonstrated success, there are opportunities to obtain increasing levels of responsibility, to assume a leadership position, and, if appropriate, to transfer to other AOA markets.\n\nESSENTIAL FUNCTIONS OF POSITION INCLUDE: \n\n* Approach existing and new advertiser clients\n* Structure advertising packages / products across AOA's product portfolio to meet advertiser needs\n* Handle internal responsibilities including contracting, scheduling and collections tracking\n* Communicate with internal leadership regarding sales projections and tracking\n* Collaborate with Account Executive colleagues to create and to promote positive working environment\n* Liaise with Account Executives in other Adams Outdoor Advertising markets to identify potential opportunities and to cross-pollinate sales\nPREFERRED QUALIFICATIONS:\n\n* Bachelor’s degree in Sales and Marketing or equivalent experience \n* One to three years direct media or relevant sales experience \n* Excellent written and oral communication skills\n* Proficient with computer software and technology \n* Good working knowledge of marketing research \n* Must be willing and able to travel, if required\n* Must have and maintain a valid driver’s license \nIn addition to Kenosha, AOA operates in the following markets: Ann Arbor/Kalamazoo/Lansing (MI), Beaufort/Charleston/Florence (SC), Charlotte (NC), Eastern Pennsylvania, Madison (WI), Norfolk (VA), Champaign/Peoria (IL).\n\nThe above statements are intended to describe the general nature and level of work being performed by the people assigned to this job. They are not intended to be an exhaustive list of all responsibilities, duties and skills required of the job.\n\nPowered by JazzHR",
          "company_object":[
             "Object"
          ],
          "normalized_title":null,
          "manager_roles":[
             
          ],
          "matching_phrases":[
             
          ],
          "matching_words":[
             
          ]
       },
       {
          "id":232048045,
          "job_title":"Managing Consultant - Remote",
          "url":"https://click.appcast.io/track/kri5c7h?cs=qli&jg=8f3a&bid=KsZTr7rt4Z3tCrf0R8jytQ==",
          "date_posted":"2024-10-04",
          "has_blurred_data":false,
          "company":"RemoteWorker CA",
          "final_url":"https://click.appcast.io/track/kri5c7h?cs=qli&jg=8f3a&bid=KsZTr7rt4Z3tCrf0R8jytQ==",
          "source_url":"https://www.linkedin.com/jobs/view/4040437053/",
          "location":"Englewood",
          "short_location":"Englewood, CO",
          "long_location":"Englewood, CO",
          "state_code":"Englewood, CO",
          "latitude":null,
          "longitude":null,
          "postal_code":null,
          "remote":true,
          "hybrid":false,
          "salary_string":"80,000-100,000",
          "min_annual_salary":null,
          "min_annual_salary_usd":null,
          "max_annual_salary":null,
          "max_annual_salary_usd":null,
          "avg_annual_salary_usd":null,
          "salary_currency":null,
          "countries":[
             
          ],
          "country":null,
          "cities":[
             
          ],
          "continents":[
             
          ],
          "seniority":"Mid-Level",
          "country_codes":[
             "Array"
          ],
          "country_code":"US",
          "discovered_at":"2024-10-04T12:25:43.905958+00:00",
          "hiring_team":[
             
          ],
          "company_domain":"remoteworker.jobs",
          "reposted":false,
          "date_reposted":null,
          "description":"Job Description\n\nJob Description\n\nManaging Consultant – Remote\n\nEmbark on the next step in your career journey with Direct Travel!\n\nAs one of the fastest growing Travel Management Companies (TMC) in the world, Direct Travel is committed to reimagining what is possible for the industry, including business travel, personalized experiences, and meetings & events. Under the forward-thinking direction of our experienced leadership team, we are rapidly expanding and leveraging next-generation technologies to deliver on our vision for The Perfect Trip. This is your opportunity to grow your career and be part of a dynamic team that is setting the new standard of travel and service excellence. If you’re passionate about innovation and ready for what’s next, we’d love for you to join us!\n\nThis position is responsible for the oversight, delivery and overall success of existing and new client projects related to their corporate Hotel programs. Programs vary in size and scope and require individual with a keen understanding of spend management. Individual in this role will engage analytics, innovative sourcing strategies and ongoing spend performance to help our clients manage supplier relationships.\n\nExpedition Expectations\n\n* Lead client engagements by managing project to timelines, client expectations and resource budgets. \n* Identify additional revenue opportunities with the client from both current and future engagements \n* Educate clients on hotel and travel industry changes and issues, and current events. \n* Prepare and conduct client presentations providing analysis and consultancy. Conduct ad hoc analysis to accommodate specific client needs \n* Stay abreast of Hotel and Travel industry trends and product changes \n* Maintain constructive relationships with account and travel managers and share trends /industry changes \n* Identify competitive industry threats and emerging problems \n* Support the Hotel team's business development and marketing efforts with client renewals and by cross selling additional services \n* Assist in creating proposals for new business\n\nPassport to Success\n\n* Management Consulting and Client Management experience\n* Project management experience \n* Good verbal, presentation and written communication skills including creating decks and other client delivery resources (Power Point required) \n* Intermediate to Advanced analytical skills for reviewing and producing large data sets (Excel required) \n* Well-developed problem solving and decision making capabilities \n* Ability to manage multiple projects and deadlines and work with global teams BS/BA degree preferred\n* Ability to compile, manipulate, and translate data required for deliverables of supplier and client reporting\n\nGoing the Extra Mile\n\n Travel supplier or agency management experience in Hotel consulting, Hotel sales, Hotel account management, or Hotel data analysis \n* Experience with Hotel Pricing and Hotel Revenue Management\n\nBenefits Onboard\n\nIn addition to Medical, Dental, and Vision benefits Direct Travel offers an employee rewards and recognitions program, Total Rewards Package which includes Wellness, Sustainability, DE&I initiatives, and Mental Health Support.\n\nOur Brand Voyage: About Direct Travel\n\nDirect Travel is a leading provider of corporate travel management services. By leveraging both the expertise of its people and innovative solutions, Direct Travel enables clients to derive the greatest value from their travel program in terms of superior service, progressive technologies, and significant cost savings. The company is led by CEO Christal Bemont and Executive Chairman Steve Singh, noted business investor and founder of Concur. Direct Travel has offices in over 80 locations and is currently ranked among the top providers of travel on Travel Weekly’s Power List. For more information, visit www.dt.com.\n\nDirect Travel is an EOE/AA/Veteran/People with Disabilities employer\nIf you're ready to chart a new course and advance your career with the valuable moments and travel experiences that await, we welcome you to submit your resume for consideration at Direct Travel.",
          "company_object":[
             "Object"
          ],
          "normalized_title":null,
          "manager_roles":[
             
          ],
          "matching_phrases":[
             
          ],
          "matching_words":[
             
          ]
       }
    ]
 }